diplom-src/src/DataProcessors/ЗаполнениеГрафикаРаботы/ЗаполнениеГрафикаРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеГрафикаРаботы</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

diplom-src/src/InformationRegisters/ВКМ_ГрафикРаботы/ВКМ_ГрафикРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикРаботы</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/DataProcessors/ЗаполнениеГрафикаРаботы/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить период");
		Возврат
	КонецЕсли;
	
	ЗаполнитьНаСервере(Объект.Период);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере(Период)
	ДатаПериода = Период.ДатаНачала;
	Пока ДатаПериода < Период.ДатаОкончания Цикл 
		Запись = РегистрыСведений.ВКМ_ГрафикРаботы.СоздатьМенеджерЗаписи();
		Запись.Дата =  ДатаПериода;
		Если ДеньНедели(ДатаПериода) <= 5 Тогда
			Запись.Значение = 1;
		КонецЕсли;
		Запись.Записать();
		ДатаПериода = ДатаПериода + 86400;	
	КонецЦикла;	

КонецПроцедуры


#КонецОбласти
